Tekla Open API Reference for Tekla Structures 2025
MaterialItem.AliasName1 Property
 The material item's alias name 1.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AliasName1 { get; set; }
Public Property AliasName1 As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace